<!-- dflook/terraform-github-actions {"workspace":"import-warnings","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"952670b39827ca0e48055aeae2746f2bebe6ea0a1273a28ebb31574f6fdc4d52","plan_job_ref":"Job Test actions using target, replace, and exclude #19 at https://github.com/dflook/terraform-github-actions/actions/runs/16830246785","plan_hash":"d9a5276204aa2f64b2194ae787e7df7167e003c5d15b84383e02eeefa0a597a4","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__ in the __import-warnings__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 5 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.also_exclude will be created
+   resource "random_string" "also_exclude" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.exclude_me will be created
+   resource "random_string" "exclude_me" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.keep_me will be created
+   resource "random_string" "keep_me" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
+   also_exclude = (known after apply)
!~  count        = "6eNyufqNXL" -> (known after apply)
+   exclude_me   = (known after apply)
!~  foreach      = "bmgoh4bPET" -> (known after apply)
+   keep_me      = (known after apply)
```
</details>

:white_check_mark: Plan applied in [Test actions using target, replace, and exclude #19](https://github.com/dflook/terraform-github-actions/actions/runs/16830246785)
<details open><summary>Outputs</summary>

```hcl
also_exclude = "C1Xr5KgQDb"
count        = "Gd1v7apmwA"
exclude_me   = "XpLPhN4g8N"
foreach      = "oyQhcSnOtU"
keep_me      = "1zM3Btu1eb"
```
</details>